package com.example.healthcare;

import android.Manifest;
import android.content.Context;
import android.content.pm.PackageManager;
import android.location.Location;
import android.location.LocationListener;
import android.location.LocationManager;
import android.os.Bundle;
import android.view.View;
import android.view.ViewGroup;
import android.widget.Button;

import androidx.appcompat.app.AppCompatActivity;
import androidx.core.app.ActivityCompat;

import net.daum.mf.map.api.MapPOIItem;
import net.daum.mf.map.api.MapPoint;
import net.daum.mf.map.api.MapView;

public class MapActivity extends AppCompatActivity implements MapView.CurrentLocationEventListener {

    private MapView mapView;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_map);

        MapView mapView = new MapView(this);

        ViewGroup mapViewContainer = (ViewGroup) findViewById(R.id.map_view);
        mapViewContainer.addView(mapView);

        // Set the current location event listener
        mapView.setCurrentLocationEventListener(this);

        // Set the current location tracking mode
        mapView.setCurrentLocationTrackingMode(MapView.CurrentLocationTrackingMode.TrackingModeOnWithoutHeading);

        mapView.setVisibility(View.VISIBLE);


        //마커
        MapPOIItem marker = new MapPOIItem();

        //배열좌표
        double[] x = {37.5163554, 37.5293925, 37.5650247, 37.6321393, 37.5496519, 37.4783254, 37.488159, 37.5382726, 37.5402736, 37.5593496, 37.5001145, 37.481958, 37.4887945, 37.4569307, 37.6542677, 37.6247913, 37.6574481, 37.6314491, 37.6578818, 37.6414121, 37.5743642, 37.5044193, 37.5658546, 37.5521303, 37.5786216, 37.5743108, 37.4835718, 37.4901927, 37.4888916, 37.567075, 37.5463509, 37.6026635, 37.5935923, 37.5145674, 37.4897179, 37.5175811, 37.5400786, 37.5313394, 37.5262063, 37.5324473, 37.6024727, 37.6097271, 37.5879843, 37.5817609, 37.5645192, 37.5543617, 37.5524303, 37.5674099, 37.6065374, 37.5930093, 37.8335563, 37.8705898, 37.953297, 37.7071142, 37.6228618, 37.9014746, 37.8873886, 37.7540724, 37.6956052, 37.8050164, 37.7874849, 37.6215051, 37.6759426, 37.86476, 37.6696334, 37.8329904, 37.7739955, 37.8180751, 37.7403864, 37.7969448, 37.9255835, 37.6578253, 37.7024876, 37.6565447, 37.6843863, 37.429497, 37.4558967, 37.4808929, 37.4165449, 37.5299867, 37.4552821, 37.3498667, 37.3046455, 37.3684216, 37.4211332, 37.4937726, 37.4772538, 37.3166887, 37.378562, 37.3526622, 37.3691035, 37.288097, 37.3688466, 37.3925494, 37.4744256, 37.6046824, 37.6311253, 37.5914627, 37.3330707, 37.3642153, 37.6234463, 37.730866, 37.6032187, 37.6491182, 37.629391, 37.74326, 37.725133, 37.7505664, 37.6644848, 37.6570423, 37.7151334, 37.6918945, 37.7200476, 37.6148572, 37.6357043, 37.6139307, 37.6578044, 37.7035639, 37.5869438, 37.585429, 37.5606591, 37.6567806, 37.6463952, 37.6546572, 37.6578044, 37.7105071, 37.6461672, 37.6987718, 37.6935968, 37.7082171, 37.8965387, 37.528036, 37.4942704, 37.4110766, 37.3905007, 37.4443958, 37.4419636, 37.4800483, 37.2586671, 37.2568229, 37.3036747, 37.2714907, 37.4453858, 37.4444429, 37.405231, 37.3984196, 37.3804331, 37.3466573, 37.3208348, 37.2225736, 37.243597, 37.3324765, 37.1116245, 37.3002605, 37.3121702, 37.3643285, 37.0002009, 36.984321, 36.9602768, 36.9780737, 37.0826967, 36.9997161, 36.997066, 37.0668587, 37.1098988, 37.0267537, 37.0894586, 37.0312878, 36.976877, 37.1181977, 37.0384752, 36.9168902, 37.0728739, 36.9430585, 36.9350343, 37.0981649, 37.0600713, 37.0395038, 37.0944244, 37.0905621, 37.0784681, 36.9840266, 37.3925118, 37.3858576, 37.7850497, 37.8933784, 37.9077873, 37.8381392, 37.8189246, 37.8660051, 37.7179367, 37.4969758, 37.5416034, 37.4958384, 37.4262866, 37.4566709, 37.4903026, 37.4183718, 37.5135194, 37.4614649, 37.63893, 37.3865944, 37.5387917, 37.4683555, 37.5634436, 37.6061504, 37.606622, 37.5812876, 37.4374829, 37.567774, 37.4242839, 37.5221087, 37.4871661, 37.4344336, 37.6005263, 37.5221127, 37.4738932, 37.5558662, 37.2946082, 37.2016372, 37.2723944, 37.2361446, 37.2016428, 37.3925175, 37.1633291, 37.2971997, 37.3736238, 37.3482331, 37.2758586, 37.3372165, 37.3289588, 37.401822, 37.1751493, 37.3731167, 37.4099576, 37.2375738, 37.2037823, 37.2057237, 37.3959987, 37.4069143, 37.3313172, 38.0234517, 38.0630483, 38.0850761, 37.9981229, 37.9589863, 38.0708733, 38.0265121, 38.0312132, 38.1841167, 37.9908542, 38.1349568, 38.0583106, 37.9818432, 38.0332754, 38.1169555, 37.1593256, 37.1766427, 37.2725373, 37.2229385, 37.2331887, 37.3221259, 37.3581564, 37.2406119, 37.1938544, 37.115299, 37.2631105, 37.3295123, 37.1384141, 37.1636455, 37.1412307, 37.2354556, 37.1666302, 37.0950475, 37.141039, 37.1242144, 37.1402651, 37.2777519, 37.3437731, 37.3912488, 37.7360962, 37.2889223, 37.2418135, 37.297585, 37.1916283, 37.1062856, 37.2221333, 37.2297264, 37.3199956, 37.3015607, 37.2499379, 37.2144957, 37.1716317, 37.3392017, 37.2832822, 37.1618005, 37.1755457, 37.3140072, 37.0893741, 37.2419307, 37.1787551, 37.1447596, 37.2527293, 37.2229109, 37.7561664, 37.8926501, 37.8526086, 37.8279524, 37.9062025, 37.7190454, 37.9948775, 37.7712952, 37.7288227, 37.9079633, 37.7993649, 37.9542869, 37.8023034, 37.9217042, 37.0664202, 37.0423756, 37.0701333, 37.1343823, 37.0559258, 37.1081937, 37.0853871, 37.0999263, 36.9907971, 36.9521117, 36.9445328, 36.9536457, 36.9857698, 37.0510184, 37.0077452, 36.9946351, 36.9397085, 37.0401256, 36.957642, 36.9739782, 36.9895164, 36.9828491, 36.9670958, 37.9007106, 37.8483936, 38.1577467, 37.8886004, 37.9357385, 37.7867165, 37.9611111, 38.0591346, 37.8534765, 37.8234699, 37.9338016, 38.0528741, 38.088993, 38.0056429, 38.0216099, 37.7775877, 38.0318383, 37.9613669, 37.815176, 38.0860512, 37.9276681, 37.9915475, 37.9276681, 37.5393555, 37.1293258, 37.1427208, 37.1781343, 37.2065075, 37.2052921, 37.2070549, 37.2054921, 37.2523446, 37.0492624, 37.1510501, 37.2170308, 37.2357746, 37.0932121, 37.1313831, 37.1663801, 37.2130748, 37.2487667, 37.1769514, 37.0819543, 37.1651083, 37.0896202, 37.2481118, 37.2015413, 37.0674695, 37.1602292, 37.151247, 37.1636011, 37.1626734};
        double[] y = {127.042089, 127.125578, 127.1737786, 127.0388033, 126.8682874, 126.9512317, 126.9324819, 127.0822723, 127.0651272, 127.0871185, 126.8893246, 126.8921487, 126.8393427, 126.8954342, 127.0565488, 127.0800428, 127.0678533, 127.0616297, 127.0388116, 127.0356359, 127.0398181, 126.9410949, 126.9009476, 126.9512961, 126.9362862, 126.9101855, 127.0328289, 127.0054799, 126.9922896, 127.0332218, 127.0442741, 127.0395338, 127.0157461, 127.1059554, 127.1426296, 126.866091, 126.8668933, 126.8318387, 126.8958164, 126.9900859, 126.9294122, 126.9127836, 126.9195312, 126.9692107, 127.0150761, 127.0082834, 127.0089767, 127.0213771, 127.0929977, 127.0808985, 127.5105392, 127.5376643, 127.4781123, 127.5396343, 127.4966759, 127.4629002, 127.550281, 127.5117556, 127.3936193, 127.3576808, 127.4318344, 127.5192282, 127.4945264, 127.3489569, 127.5155739, 127.2897419, 127.3713098, 127.3532743, 127.4240933, 127.335234, 127.5673608, 126.830993, 126.90119, 126.77581, 126.7758627, 126.9873578, 126.8784501, 126.8504548, 127.25038, 127.3405861, 127.3362918, 127.1671352, 127.3311317, 127.4065249, 127.3239171, 127.3028731, 127.1895344, 127.3053354, 127.3184956, 127.3666795, 127.2322012, 127.3208799, 127.3027549, 127.2293985, 127.305755, 127.1450492, 127.1165587, 127.1386555, 126.9256756, 126.933055, 126.722704, 126.5923996, 126.7710786, 126.5817513, 126.5888895, 126.6334417, 126.6507217, 126.5380485, 126.5583603, 126.625504, 126.5528427, 126.5973545, 126.6308512, 126.6001735, 127.216278, 127.155568, 127.3004583, 127.3260324, 127.2955398, 127.2167374, 127.3137391, 127.1793363, 127.1455572, 127.2487521, 127.3004583, 127.1894619, 127.1218765, 127.2047623, 127.2150681, 127.1177198, 127.0518504, 126.7962865, 126.780963, 127.1246846, 127.0778655, 127.1440624, 127.1707037, 126.7999512, 126.9710934, 127.0694645, 127.0100395, 127.0125019, 126.7850001, 126.8308745, 126.7723659, 126.8005087, 126.7618855, 126.7401276, 126.815293, 126.5763814, 126.5848109, 126.7903642, 126.3923048, 126.8450662, 126.9045162, 126.8771502, 127.2697894, 127.3055383, 127.1874106, 127.1362623, 127.2634652, 127.1661051, 127.3168819, 127.5013291, 127.2472248, 127.4398203, 127.3089558, 127.1955566, 127.2157291, 127.4333972, 127.3078781, 127.2581942, 127.3748504, 127.2594675, 127.2332771, 127.289381, 127.1944432, 127.1288673, 127.3705674, 127.4770341, 127.4224686, 127.3457097, 126.9505312, 126.932929, 127.0452501, 126.9582979, 127.0075499, 127.068038, 126.9506449, 127.0060989, 126.9412049, 127.4866536, 127.7643291, 127.41089, 127.5369754, 127.7706771, 127.6997156, 127.6138476, 127.4023124, 127.7362076, 127.4279933, 127.7135343, 127.6733367, 127.3965788, 127.6695729, 127.6012812, 127.3487443, 127.4202261, 127.4941569, 127.7615412, 127.7519187, 127.4588209, 127.5965771, 127.6852263, 127.4259885, 127.6136077, 127.6383561, 127.7110427, 127.640389, 127.5452341, 127.7124002, 127.7096415, 127.6210939, 127.533332, 127.6604683, 127.5716173, 127.58725, 127.7486024, 127.5585789, 127.5838605, 127.6780726, 127.4429478, 127.6353366, 127.6417873, 127.5675646, 127.5571003, 127.7120975, 127.662419, 127.6806548, 127.5039075, 127.5431334, 127.0609007, 127.1105701, 127.0187685, 126.9190067, 127.0081586, 126.9525831, 126.9867584, 126.9138845, 127.1066459, 127.0232694, 127.0770173, 127.0125625, 126.8843567, 127.1099506, 126.986274, 127.0777088, 127.0545706, 127.1068296, 127.0981525, 127.1095028, 127.0975778, 127.0680456, 127.1777838, 127.3655078, 127.1502565, 127.2666613, 127.242365, 127.3959112, 127.3750381, 127.1677059, 127.2798673, 127.3135122, 127.1447681, 127.1960731, 127.3737194, 127.3091468, 127.2309312, 126.9720664, 126.9949533, 127.0395257, 127.4523075, 127.5167586, 127.5261137, 127.501073, 127.5467611, 127.4506498, 127.4923137, 127.4395356, 127.3888899, 127.3584999, 127.3959136, 127.4820162, 127.4901671, 127.4866877, 127.5095784, 127.4391517, 127.4986746, 127.5793364, 127.439111, 127.5837515, 127.529444, 127.4065092, 127.4246257, 126.7738978, 126.8417964, 126.7844038, 126.7250934, 126.7318293, 126.7687139, 126.9907686, 126.9009557, 126.7466242, 126.8967766, 126.7892057, 126.9176126, 126.7161438, 126.837906, 127.0672189, 127.0177594, 127.0084052, 127.108231, 127.0087813, 127.0354179, 127.1225162, 127.0907704, 127.1117525, 126.9525739, 127.0255733, 126.8826131, 126.9314779, 126.9773549, 126.9803169, 126.8410207, 126.9013059, 126.9345385, 127.0599461, 127.0428647, 126.8474564, 126.8852975, 126.9212051, 127.2012299, 127.1860687, 127.2511051, 127.2172203, 127.2803815, 127.2271404, 127.124922, 127.3844898, 127.1593088, 127.1389308, 127.2264562, 127.2698132, 127.2754276, 127.2452989, 127.1860927, 127.1497367, 127.3681899, 127.3173559, 127.1683864, 127.2063536, 127.2647628, 127.1891914, 127.2647628, 127.2149791, 126.9048616, 126.701838, 126.9093489, 126.7983259, 127.0348932, 127.078604, 126.7696384, 126.9100159, 126.7653186, 126.9731838, 126.9610907, 126.8735151, 126.9694652, 126.8434851, 126.7089997, 126.7324831, 126.7174804, 126.8188612, 126.945549, 127.0949218, 126.8154713, 126.8409933, 126.873382, 126.8473012, 126.9717987, 127.006863, 126.6222529, 126.9046622};


        //배열의 크기
        double[] array = new double[393];

        String Name[] = {"선릉로 668",
                "성내로 45  (성내동, 강동구보건소)",
                "아리수로93길 9-14  (강일동, 강일동복합청사)",
                "한천로 897 (번동, 강북보건소,번2동 주민센터)",
                "공항대로 561  (염창동, 강서보건소)",
                "관악로 145, 2동  (봉천동, 관악구청)",
                "봉천로 279-7  (봉천동, 관악구보건지소)",
                "자양로 117, 제2별관 광진구보건소 (자양동, 광진구청)",
                "아차산로24길 17 2층 (자양동, 자양공공힐링센터)",
                "긴고랑로 110 보건지소(1,2층) (중곡동, 중곡종합건강센터)",
                "구로중앙로28길 66  (구로동, 구로구보건소)",
                "디지털로 243  (구로동, 지하이시티)",
                "오리로10길 44-3  (오류동)",
                "시흥대로73길 70",
                "노해로 437, 보건소 노원구 보건소 (상계동, 노원구청)",
                "공릉로 166-1  (공릉동, 공릉보건지소)",
                "상계로 118 3층 상계보건지소 (상계동, 상계2동복합청사)",
                "월계로 378  (월계동, 노원보건지소)",
                "방학로3길 117 도봉구 보건소 (쌍문동, 도봉보건소, 쌍문2동주민센터)",
                "덕릉로59길 73-3 창동 보건지소 (창동, 창2동주민센터(창동보건지소))",
                "천호대로 145 동대문구보건소 (용두동, 동대문구청)",
                "장승배기로10길 42  (상도동, 동작문화복지센타)",
                "월드컵로 212, 마포구보건소  (성산동, 마포구청)",
                "마포대로11길 44-81  (아현동, 아현문화건강센터)",
                "연희로 242, 서대문구청별관  (연희동, 서대문구보건소)",
                "수색로 100-55  (북가좌동, 북가좌1동주민센터)",
                "남부순환로 2584, 보건소  (서초동, 서초구청)",
                "서초대로38길 12, 힐스테이트 서리풀 101동 1층 (서초동, 마제스타시티, 힐스테이트 서리풀)",
                "방배로 173, 방배열린문화센터 2층 방배보건지소 (방배동, 방배열린문화센터(방배4동주민센터))",
                "마장로23길 10",
                "왕십리로5길 3 4층 (성수동1가, 성수1가제2동 공공복합청사)",
                "화랑로 63 (하월곡동, 성북구 보건소)",
                "아리랑로3길 8 (동소문동6가, 성북구보건지소 ,동선보건지소)",
                "올림픽로 326, 보건소  (신천동, 송파구청)",
                "양산로 5  (거여동, 송파구 보건지소)",
                "목동서로 339  (신정동, 양천보건소)",
                "목동중앙본로7가길 11  (목동, 목동보건지소)",
                "남부순환로 407  (신월동)",
                " 당산로 123 영등포구 보건소 (당산동3가, 영등포구청)",
                "녹사평대로 150 용산보건소 (이태원동, 용산구종합행정타운)",
                "은평로 195, 은평구보건소  (녹번동)",
                "연서로13길 29-7  (구산동, 구산보건지소)",
                "가좌로 195  (응암동, 응암보건지소)",
                "자하문로19길 36  (옥인동, 종로구보건소, 청운효자동자치회관)",
                "다산로39길 16",
                "동호로15길 50  (신당동, 다산동주민센터.)",
                "다산로 92  (신당동, 약수동주민센터)",
                "난계로11길 52  (황학동, 황학동주민센터)",
                "봉화산로 179  (신내동, 중랑구청)",
                "동일로114길 10 상봉보건지소 (상봉동, 상봉2동 복합청사)",
                "가평읍 가화로 155-18  (가평군보건소)",
                "가평읍 당목가일길 211-80  (개곡보건진료소)",
                "북면 가화로 2370-14  (도대보건진료소)",
                "설악면 미사리로 629  (미사보건진료소)",
                "설악면 양방가루재길 4-18  (방일보건진료소)",
                "북면 백둔로 417-9  (백둔보건진료소)",
                "북면 화악산로 23, 1층 보건소, 2층 다가구주택  (북면 보건소)",
                "가평읍 호반로 1799-8  (산유보건진료소)",
                "청평면 북한강로2010번길 18, 가동  (삼회보건진료소)",
                "상면 청군로 1099, F동  (상면보건지소)",
                "청평면 수리재길 293-19  (상천보건진료소)",
                "설악면 봉미산안길7번길 1-6, B동  (설곡보건진료소)",
                "설악면 한서로 6, 7동  (설악면보건지소)",
                "하면 현등사길 (조종면)7-16  (운악보건진료소)",
                "설악면 한서로 228-16, 위곡리보건진료소  (위곡2리마을회관)",
                "상면 청군로 2043-15  (율길보건진료소)",
                "상면 청군로 699  (임초보건진료소)",
                "하면 조종내길 75, F동  (조종면보건지소)",
                "청평면 은고개로 15, 청평면보건지소  (청평면보건지소)",
                "상면 아랫벌길 11  (태봉리보건소)",
                "북면 화악지암길 4  (화악보건진료소)",
                "덕양구 원당로33번길 28",
                "덕양구 혜음로 19-11",
                "일산동구 중앙로 1228  (마두동, KT고양지사)",
                "일산서구 일중로 54 일산서구보건소 (일산동, 일산서구보건소)",
                "관문로 69",
                "오리로 613  (하안동, 광명시보건소)",
                "오리로 1018  (광명동, 광명종합사회복지관)",
                "파발로 194  (경안동, 광주시보건소)",
                "남종면 산수로 2331  (검천리보건진료소)",
                "퇴촌면 천진암로 653-8  (관음리보건진료소)",
                "오포읍 창뜰아랫길 6  (능평리복합문화시설)",
                "도척면 노곡로 20  (도척면사무소)",
                "곤지암읍 만선로 59 11-8",
                "초월읍 무갑길 140번길 14",
                "남종면 산수로 1613-9",
                "중부면 남한산성로 732-20",
                "도척면 상림마을길 99-3",
                "초월읍 선동길 22",
                "곤지암읍 광여로 214",
                "오포읍 오포로 884-1",
                "도척면 도척로 773-7",
                "초월읍 경충대로 1009-40",
                "고불로 79",
                "퇴촌면 산수로 1347",
                "건원대로34번길 84  (인창동, 구리보건소)",
                "산마루로 24 5층 (갈매동, 신성타워)",
                "체육관로 74 1층 (수택동, 구리시행정복지센터)",
                "군포로 221  (부곡동, 군포시보건소)",
                "산본천로 101, 산본보건지소  (산본동, 군포시 늘푸른 노인복지관)",
                "사우중로 108",
                "월곶면 애기봉로 455",
                "고촌읍 장차로 14",
                "대곶면 율생로 83-23",
                "대곶면 수남로22번길 7",
                "하성면 후평로 3",
                "하성면 석평로166번길 10",
                "월곶면 문수산로252번길 42",
                "대곶면 송마로 30",
                "양촌읍 양곡1로68번길 37",
                "월곶면 군하로 263",
                "통진읍 김포대로2250번길 24-11",
                "하성면 애기봉로 845",
                "양촌읍 첫섬로 11",
                "경춘로 1037, 남양주보건소  (금곡동, 남양주시청제1청사)",
                "다산중앙로 7 다산건강생활지원센터 (다산동, 다산행정복지센터)",
                "화도읍 비룡로 59(화도수동행정복지센터)",
                "수동면 비룡로 729 1층(수동종합행정타운) (수동면사무소)",
                "조안면 고래산로 413-48 시우보건진료소",
                "와부읍 월문천로 35 와부건강생활지원센터 (와부조안행정복지센터)",
                "조안면 북한강로 433 조안보건지소 (조안보건소)",
                "진건읍 사릉로 406-1, 서부희망케어센터 진건보건지소 (서부희망케어센터)",
                "퇴계원면 경춘북로558번길 10-3 퇴계원다목적회관 1층",
                "호평로68번길 21 호평평내건강생활지원센터 (호평동, 호평평내행정복지센터)",
                "화도읍 비룡로 59 화도수동건강생활지원센터 (화도수동행정복지센터)",
                "진접읍 해밀예당1로 30-39, 북부종합보건복지타운",
                "별내3로 64-21, 별내동 주민센터 별관 2층 별내건강생활지원센터 (별내동, 별내동 주민센터)",
                "오남읍 진건오남로 806-34 2층, 오남건강생활지원센터 (오남읍사무소)",
                "오남읍 진건오남로690번길 12  (오남보건진료소)",
                "별내면 청학로 86  (청학보건지소)",
                "중앙로 167",
                "성오로 172 오정보건소 (오정동, 오정어울마당)",
                "옥산로10번길 16  (중동, 부천시보건소)",
                "분당구 양현로 306  (야탑동, 분당보건소)",
                "분당구 운중로138번길 10 운중동 행정복지센터 (운중동, 운중동 행정복지센터 ,판교 보건지소)",
                "수정구 수정로 218  (신흥동, 수정구보건소)",
                "중원구 금상로 137 중원구보건소 (상대원동, 중원구보건소)",
                "경인옛로 73  (소사본동, 소사본동 행정복지센터, 소사어울마당)",
                "권선구 호매실로 22-50  (탑동, 권선구보건소)",
                "영통구 영통로 396  (영통동, 영통구보건소)",
                "장안구 송원로 101",
                "팔달구 팔달산로 6  (교동, 팔달구 보건소)",
                "호현로 55, 주차장 시흥시보건소 (대야동, 시흥시보건소대야종합사회복지관)",
                "금오로 474 과림보건진료소 (과림동, 과림보건진료소)",
                "새우개2길 59 신현보건진료소 (포동, 신현보건진료소)",
                "하중로 136  (하중동, 연성보건진료소)",
                "군자로 32  (월곶동, 월곶보건진료소)",
                "정왕대로233번길 19  (정왕동, 정왕보건소)",
                "단원구 화랑로 250 단원보건소 (초지동)",
                "단원구 비룰길 7 남동보건진료소 (대부남동, 남동보건진료소)",
                "단원구 대부중앙로 97-10 대부보건지소 (대부북동, 대부보건지소)",
                "단원구 부부로 43 원곡보건지소 (원곡동, 안산시다문화지원본부)",
                "단원구 풍도2길 4  (풍도동)",
                "상록구 차돌배기로1길 5 상록수보건소 (사동, 상록수보건소)",
                "상록구 건건로 119-4 반월보건지소 (건건동, 반월보건지소)",
                "상록구 원당골1길 23-3 수암보건지소 (수암동)",
                "강변로74번길 18",
                "금광면 금광오산로 16-1",
                "미양면 개정길 1",
                "공도읍 진건중길 206-9",
                "고삼면 고삼호수로 21",
                "공도읍 공도로 51-11  (공도 건강생활지원센터)",
                "금광면 금광오산로 228",
                "일죽면 산전길 24-9",
                "양성면 미리내성지로 14",
                "죽산면 당진길 5-13",
                "보개면 보개원삼로 1031-11",
                "양성면 속말길 10",
                "미양면 후평길 1",
                "일죽면 사실로 78-10",
                "보개면 복평길 58",
                "서운면 평리길 42-1",
                "삼죽면 삼죽로 112",
                "서운면 서운중앙길 23",
                "서운면 안성맞춤대로 133-6",
                "고삼면 쌍지길 4",
                "양성면 사복길 5",
                "원곡면 가천중앙1길 45",
                "삼죽면 품곡길 32",
                "일죽면 금일로 433 일죽보건지소",
                "죽산면 죽산초교길 61",
                "금광면 진안로 568-6",
                "동안구 평촌대로253번길 41  (비산동, 동안구보건소)",
                "만안구 문예로 48  (안양동, 만안구보건소)",
                "부흥로 1533, 양주시보건소 (남방동, 양주시보건소)",
                "남면 휴암로443번길 29-4",
                "은현면 봉암14길 6",
                "화합로1426번길 90 양주체육복지센터 5층 (덕정동)",
                "백석읍 부흥로419번길 26",
                "은현면 화합로610번길 161-13",
                "장흥면 권율로 7",
                "양평읍 마유산로 17, 양평군보건소",
                "청운면 경강로 4839 갈운보건진료소",
                "강하면 운심길 44, 강하보건지소  (강하보건지소)",
                "개군면 하자포길33번길 6  (개군보건지소)",
                "양동면 양서북로 518  (계정보건진료소)",
                "양동면 아랫고슬길8번길 5  (고송보건진료소)",
                "지평면 곡수길 52, 곡수보건진료소  (곡수보건진료소)",
                "양서면 복개길5번길 21  (양서면국수출장소)",
                "양동면 월리터1길 10  (금왕보건진료소)",
                "서종면 화서1로 258, 노문보건진료소  (노문보건진료소)",
                "양동면 거단길 163  (단석보건진료소)",
                "단월면 보룡길 53-4, 단월보건지소  (단월보건지소)",
                "강하면 동오1길 42, 동오보건진료소  (동오보건진료소)",
                "단월면 단월로 326, 부안보건진료소  (부안보건진료소)",
                "단월면 봉미산샘골길 10, 산음보건진료소  (산음보건진료소)",
                "서종면 북한강로 777, 서종보건소  (서종보건소)",
                "서종면 퉁점길 69-1",
                "강상면 세월길 139-1  (세월보건지소)",
                "청운면 신론로 196  (신론보건진료소)",
                "양동면 학둔지아래길 22  (양동면 보건지소)",
                "옥천면 옥천체육공원길 34, 옥천보건지소  (옥천보건지소)",
                "용문면 용문로 393, 용문보건지소  (용문보건지소)",
                "지평면 구둔영화체험길 8  (일신보건진료소)",
                "서종면 중미산로 820  (정배보건진료소)",
                "용문면 청용길 12, 조현보건소  (조현보건소)",
                "지평면 지평의병로116번길 7-1, 지평보건지소  (지평보건지소)",
                "청운면 용두로164번길 7, 청운보건지소  (청운보건지소)",
                "여흥로160번길 14  (상동, 여주시보건소)",
                "가남읍 태평중앙1길 20, 가남읍보건지소  (가남읍사무소)",
                "강천면 강문로 586  (강천면보건소)",
                "강천면 강천리길 62-1  (강천보건진료소)",
                "가남읍 금당리길 108  (금당보건진료소)",
                "금사면 이포로 27  (금사면사무소)",
                "점동면 성주로 591  (뇌곡보건진료소)",
                "능서면 양화로 913  (능서보건지소)",
                "대신면 율촌1길 47  (대신면보건지소)",
                "강천면 원심동1길 32  (도전보건진료소)",
                "능서면 양화로 621  (매류보건진료소)",
                "능서면 능서로 495  (백석보건진료소)",
                "북내면 당우2길 10  (북내보건지소)",
                "산북면 상품로 93  (산북면사무소)",
                "가남읍 삼정길 5  (삼승보건진료소)",
                "대신면 상구2길 3  (상구보건진료소)",
                "대신면 여양1로 218  (송촌보건진료소)",
                "가남읍 오산1길 5  (오산보건진료소)",
                "점동면 안평로 284-3  (장안보건진료소)",
                "점동면 청안로 130-6  (점동보건지소)",
                "북내면 여양2로 1104  (주암보건진료소)",
                "금사면 금품1로 712  (금사면 하호보건진료소)",
                "흥천면 효자로 131-12  (흥천보건지소)",
                "전곡읍 은대성로 95",
                "연천읍 현문로 427",
                "군남면 군남로 417",
                "백학면 진목로2번길 32",
                "전곡읍 양연로 598",
                "왕징면 왕산로 832-1",
                "미산면 청정로 1325",
                "백학면 두일로 157",
                "신서면 도대로3번길 63",
                "전곡읍 양원로46번길 13-5",
                "연천읍 신망로15번길 30",
                "왕징면 왕산로 44",
                "장남면 장백로 244",
                "청산면 아우라지길 22",
                "중면 군중로 902",
                "경기동로 59",
                "문헌공로 45 건강생활지원센터 (금암동, 신장동주민센터)",
                "기흥구 신갈로58번길 11  (신갈동, 신갈동주민센터및기흥구보건소)",
                "기흥구 동탄기흥로 713-1  (고매동)",
                "기흥구 공세로90번길 64  (공세동, 공세보건진료소)",
                "수지구 포은대로 435  (풍덕천동, 수지구청,수지보건소)",
                "수지구 호수로 11-3 고기보건진료소 (고기동)",
                "처인구 중부대로 1199, 보건소  (삼가동, 용인시청)",
                "처인구 백암면 가창로24번길 25  (가창보건진료소)",
                "처인구 남사면 내기로 22  (남사면사무소)",
                "처인구 양지면 한터로571번길 25  (대대보건진료소)",
                "처인구 모현읍 독점로 31-6  (모현읍사무소)",
                "처인구 백암면 죽양대로797번길 10",
                "처인구 백암면 백암로 189  (백암면사무소)",
                "처인구 남사면 남산로6번길 2  (아곡보건진료소)",
                "처인구 양지면 양지로105번길 5  (양지면사무소)",
                "처인구 원삼면 원양로 64  (원삼면사무소)",
                "처인구 남사면 천덕산로421번길 8-1  (원암보건진료소)",
                "처인구 이동읍 경기동로 673  (이동읍사무소)",
                "처인구 백암면 삼백로 599-3  (장평보건진료소)",
                "처인구 원삼면 보개원삼로 1634  (죽능보건진료소)",
                "처인구 포곡읍 포곡로 258  (포곡읍사무소)",
                "오봉로 34 의왕시보건소",
                "덕장로 19 청계보건지소(청계종합사회복지관내1층)",
                " 범골로 131  (의정부동, 의정부시보건소)",
                "증신로153번길 13  (증포동, 이천시보건소)",
                "부발읍 황무로2065번길 96  (가산보건진료소)",
                "부발읍 중부대로1997번길 112 고백보건진료소",
                "대월면 대월로436번길 122 군량보건진료소",
                "설성면 진상미로180번길 25  (남부통합보건지소)",
                "단월로38번길 3  (단월동, 단월보건진료소)",
                "대월면 사동로 1-10 대월보건지소",
                "신둔면 원적로 425  (도암보건진료소)",
                "신둔면 황무로347번길 7",
                "마장면 오천로 105-23  (마장보건지소)",
                "호법면 이섭대천로100번길 40  (매곡보건진료소)",
                "모가면 대월로63번길 54 모가보건지소",
                "백사면 원적로 1030  (백사면 보건지소)",
                "부발읍 무촌로 117  (부발보건지소)",
                "설성면 설가로301번길 43-17  (상봉보건진료소)",
                "모가면 사실로 716  (어농보건진료소)",
                "백사면 청백리로 380  (우곡보건진료소)",
                "율면 임오산로362번길 70 월포보건진료소",
                "호법면 이섭대천로793번길 23  (유산보건진료소)",
                "장호원읍 나래천로509번길 129-4 장북보건진료소",
                "설성면 설성로 173-5 장천보건진료소",
                "마장면 중부대로638번길 15, 표교보건진료소  (표교보건진료소)",
                "호법면 이섭대천로527번길 27 호법보건지소",
                "후곡로 13 13 (금촌동, 파주시보건소)",
                "파평면 파평산로363번길 34",
                "문산읍 개포래로 34",
                "탄현면 방촌로955번길 131",
                "군내면 통일촌길 231",
                "하우3길 77, 야당보건진료소 (야당동)",
                "적성면 어삼로 34",
                "광탄면 기산로 9",
                "해솔로 90",
                "법원읍 곰시길 173-7",
                "월롱면 엘지로 17 월롱보건지소",
                "적성면 청송로 1013",
                "탄현면 방촌로649번길 24-7 1층 (탄현면사무소)",
                "파평면 청송로 189-21",
                "서정로 295 북부보건복지센터 (서정동, 송탄보건소)",
                "고덕면 고덕로 283 고덕보건지소 (고덕면사무소)",
                "서탄면 금각1길 6-5  (금각리보건진료소)",
                "진위면 동천2길 14  (동천리보건진료소)",
                "고덕면 문곡길 5  (문곡리보건진료소)",
                "서탄면 금암2길 122 서탄보건지소 (서탄면사무소)",
                "진위면 은산3길 26 은산보건진료소",
                "진위면 봉남길 61 진위보건지소 (진위면사무소)",
                "평택5로 56  (비전동)",
                "현덕면 현덕로 387  (덕목리보건진료소)",
                "팽성읍 두정길 67  (두정리보건진료소)",
                "포승읍 중간촌길 18-4  (포승읍신영리보건진료소)",
                "안중읍 안현로 400, 1,2,3동  (안중읍사무소)",
                "청북면 청원로 427  (어연리보건소)",
                "오성면 숙성시장길 23  (오성면사무소)",
                "포승읍 포승원정길 23  (포승읍원정리보건진료소)",
                "현덕면 장수안길 35  (장수리보건진료소)",
                "청북면 청원로 2  (청북면사무소)",
                "팽성읍 팽성남산4길 6",
                "팽성읍 팽성북로 29, 보건소  (원정리보건진료소)",
                "포승읍 여술로 47  (다목적복지회관)",
                "포승읍 서동대로 1174-16  (포승읍사무소)",
                "현덕면 인광길 84",
                "포천로 1612",
                "가산면 선마로 223",
                "관인면 관인로 14",
                "군내면 청군로3290번길 12  (군내보건지소)",
                "일동면 영일로 668-27",
                "내촌면 내촌로 71-12",
                "신북면 청신로 896",
                "이동면 화동로 2433번길 11-14",
                "삼육사로2186번길 11-15",
                "소흘읍 호국로 567",
                "신북면 호국로 2065  (신북면사무소)",
                "영북면 호국로 3541",
                "영북면 영북로 166",
                "영중면 양문로 151",
                "창수면 창동로 15",
                "소흘읍 이곡길 10",
                "이동면 화동로 2070-44",
                "일동면 화동로1099번길 30",
                "가산면 정금로 67-1",
                "관인면 창동로 853",
                "화현면 봉화로 920",
                "창수면 메치골로 178",
                "화현면 봉화로 920  (지현리보건진료소)",
                "대청로 10, 보건소  (신장동, 하남시청)",
                "향남읍 3.1만세로 1055  (화성시보건소)",
                "서신면 궁평항로 1419  (궁평보건진료소)",
                "팔탄면 아랫사내길 66-8",
                "남양읍 남양시장로 25-2  (남양보건지소)",
                "떡전골로 72-3  (병점동)",
                "노작로 226-9  (석우동, 동탄보건지소)",
                "마도면 마도북로 389, 가동  (마도면사무소)",
                "매송면 매송로 43  (매송면사무소)",
                "우정읍 기아자동차로 221-6  (매향보건진료소)",
                "정남면 문학로 84  (문학리 보건진료소)",
                "봉담읍 동화새터길 109  (봉담주민건강지원센터)",
                "비봉면 비봉로 72-14",
                "양감면 사창길 18-18",
                "팔탄면 대평안길 6  (서근보건진료소)",
                "서신면 궁평항로 1702  (서신보건지소)",
                "송산면 사강시장길 26  (송산보건소)",
                "송산면 신천길 85  (신천보건진료소)",
                "남양읍 고향의봄길216번길 101  (안석보건진료소)",
                "양감면 초록로 7, 면사무소  (양감면사무소)",
                "동탄순환대로 13 낙워프라자 (송동)",
                "우정읍 쌍봉로 109-14  (우정읍 행정복지센터)",
                "비봉면 남이로 241-3  (유포보건진료소)",
                "비봉면 푸른들판로1125번길 45",
                "장안면 포승장안로 1219  (장안보건지소)",
                "정남면 서봉로 998  (정남면사무소)",
                "정남면 정남동로 355  (정림보건소)",
                "서신면 해안길 156-2  (제부리보건진료소)",
                "팔탄면 구장길 20  (팔탄보건지소)"
        };

        //맵 포인트 위도경도 설정
        for(int i=0; i<array.length; i++){
            MapPoint mapPoint = MapPoint.mapPointWithGeoCoord(x[i], y[i]);
            marker.setItemName((Name[i]));

            marker.setTag(0);
            marker.setMapPoint(mapPoint);
            marker.setMarkerType(MapPOIItem.MarkerType.BluePin); // 기본으로 제공하는 BluePin 마커 모양.
            marker.setSelectedMarkerType(MapPOIItem.MarkerType.RedPin); // 마커를 클릭했을때, 기본으로 제공하는 RedPin 마커 모양.

            mapView.addPOIItem(marker);
        }
        // 버튼 생성 및 이벤트 처리

        Button myLocationBtn = findViewById(R.id.my_location_button);
        myLocationBtn.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                // 위치 받아오는 코드 작성
                LocationManager locationManager = (LocationManager) getSystemService(Context.LOCATION_SERVICE);
                LocationListener locationListener = new LocationListener() {
                    @Override
                    public void onLocationChanged(Location location) {
                        double latitude = location.getLatitude();
                        double longitude = location.getLongitude();
                        mapView.setMapCenterPoint(MapPoint.mapPointWithGeoCoord(latitude, longitude), true);
                    }

                    @Override
                    public void onStatusChanged(String provider, int status, Bundle extras) {}

                    @Override
                    public void onProviderEnabled(String provider) {}

                    @Override
                    public void onProviderDisabled(String provider) {}
                };
                if (ActivityCompat.checkSelfPermission(MapActivity.this, Manifest.permission.ACCESS_FINE_LOCATION) != PackageManager.PERMISSION_GRANTED &&
                        ActivityCompat.checkSelfPermission(MapActivity.this, Manifest.permission.ACCESS_COARSE_LOCATION) != PackageManager.PERMISSION_GRANTED) {
                    // 권한 요청
                    ActivityCompat.requestPermissions(MapActivity.this, new String[]{Manifest.permission.ACCESS_FINE_LOCATION, Manifest.permission.ACCESS_COARSE_LOCATION}, 1);
                    return;
                }
                locationManager.requestLocationUpdates(LocationManager.GPS_PROVIDER, 0, 0, locationListener);
            }

        });
    }

    @Override
    public void onCurrentLocationUpdate(MapView mapView, MapPoint mapPoint, float v) {

    }

    @Override
    public void onCurrentLocationDeviceHeadingUpdate(MapView mapView, float v) {

    }

    @Override
    public void onCurrentLocationUpdateFailed(MapView mapView) {

    }

    @Override
    public void onCurrentLocationUpdateCancelled(MapView mapView) {

    }


}
